#### random함수

In [5]:
import random
print(random.random())              # 0.0 <= x < 1.0 사이
print(random.randint(1, 10))        # 1에서 10 사이의 정수 중에서 난수값 리턴
print(random.uniform(10, 20))       # min max 사이 float 리턴
print(random.randrange(10))         # 지정범위 int 리턴
print(random.choice([1,2,3,4,5]))   # 리스트 내부에 있는 요소를 랜덤하게 선택

0.002147270360113973
10
19.67355188552775
5
1

In [11]:
list = [1,2,3,4,5]
random.shuffle(list)    # 리스트 요소들을 랜덤하게 섞기
print(list)

[5, 2, 3, 1, 4]

In [13]:
print(random.sample([1,2,3,4,5], k = 2))     # 리스트의 요소 중 k개 뽑기

[1, 5]

#### numpy의 np.random
- NumPy의 random 서브패키지에는 난수를 생성하는 다양한 명령을 제공
- rand : 0부터 1사이의 균일 분포
- randn : 가우시안 표준 정규 분포
- randint : 균일 분포의 정수 난수

- np.random.seed       # seed를 통한 난수 생성
- np.random.randint    # 균일 분포의 정수 난수 1개 생성
- np.random.rand       # 0부터 1사이의 균일 분포에서 난수 매트릭스 array 생성
- np.random.randn      # 가우시안 표준 정규 분포에서 난수 매트릭스 array 생성
- np.random.shuffle    # 기존의 데이터의 순서 바꾸기
- np.random.choice     # 기존의 데이터에서 sampling
- np.random.uniform      

#### 다차원의 array 형태로 정규분포(np.random.normal)로부터 무작위 샘플을 생성
np.random.normal(size=(2,3,4))

#### 앞(head) 또는 뒤(tail) (n=1) 가 나올 확률이 각 50%(p=0.5)인 동전 던지기를 20번(size)
np.random.binmial(n=1, p=0.5, size=20)
np.unique            # 중복되지 않은 값의 리스트 출력
np.bincount          # 발생하지 않은 사건에 대해서도 카운트

In [14]:
import numpy as np
# numpy.random.randint(low, high=None, size=None)
# np.random.randint(6)    # 0부터 5까지 랜덤한 숫자 1개
# np.random.randint(1,20) # 1부터 19까지 숫자중 랜덤한 숫자 1개

np.random.randint(10, 20, size=(3,5))

array([[10, 16, 15, 15, 10],
       [18, 14, 13, 11, 15],
       [13, 12, 16, 19, 17]])

In [16]:
import numpy as np
# np.random.rand(6)      # 0부터 1사이의 균일분포에서 난수 매트릭스 array 생성
np.random.rand(3,2)

array([[0.39161622, 0.54611623],
       [0.39058818, 0.94471177],
       [0.83453889, 0.2689472 ]])

In [23]:
# np.random.randn(6)      # 평균 0, 표준편차 1의 가우시안 표준정규분포 난수를 매트릭스 array 생성
np.random.randn(3,2)

array([[ 0.90125525, -1.13299396],
       [-1.31212606, -1.18987788],
       [ 0.23371096,  0.53305552]])

In [26]:
# numpy.random.choice(a, size=None, replace=True)
# a : 배열이면 원래의 데이터, 정수이면 arange(a) 명령으로 데이터 생성
# size : 정수, 샘플 숫자
# replace : 불리언. True이면 한번 선택한 데이터를 다시 선택 가능

# print(np.random.choice([1,2,3,4,5]))

np.random.choice(5, 5, replace=False)   # shuffle 명령과 같다

array([0, 3, 1, 2, 4])

In [27]:
list = [1,2,3,4,5]
np.random.shuffle(list)
print(list)

[2, 1, 5, 4, 3]

In [28]:
a = np.array([11, 11, 2, 2, 34, 34])
index,count = np.unique(a, return_counts=True)
print(index)
print(count)

[ 2 11 34]
[2 2 2]

In [29]:
# 0부터 minlength -1 까지의 숫자에 대해 각각 카운트

np.bincount([1,1,2,2,2,3], minlength=6)

array([0, 2, 3, 1, 0, 0], dtype=int64)

In [33]:
# 1보다 크거나 2보다 작은 세 개의 수를 반환
# np.random.uniform(a, b, c)   # a부터 b까지의 float중 c개를 랜덤하게 뽑아줌

np.random.uniform(2.0, 5.0, 10)

array([3.80998839, 4.5427416 , 2.50769128, 2.19045764, 4.75913968,
       3.81402651, 2.69857736, 2.99641572, 4.16016831, 4.77040487])

In [36]:
# random_sample은 uniform 함수의 최소값, 최대값을 각각 0.0, 1.0으로 지정한 것과 같음

mt1 = np.random.uniform(0.0, 1.0,(2,3))
mt2 = np.random.random_sample((2,3))
display(mt1)
print(mt2)

array([[0.44724858, 0.56819996, 0.96487468],
       [0.9652588 , 0.46652304, 0.32191897]])

[[0.43087507 0.92433537 0.56567293]
 [0.66995885 0.43460042 0.61190714]]

In [82]:
import numpy as np
import pandas as pd
np.random.seed(0)
index = [np.arange(5)]
columns = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"]
df = pd.DataFrame(np.arange(50).reshape(5,10), index, columns = columns)

display(df)

index2 = [np.arange(5)]
columns2 = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"]
df2 = pd.DataFrame(np.random.randint(0, 50,size = (5,10))*5, index2, columns = columns2)

display(df2)

index3 = [np.arange(5)]
columns3 = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"]
df3 = pd.DataFrame(np.random.choice(50, size = (5,10))*5, index3, columns = columns3)

display(df3)

    A   B   C   D   E   F   G   H   I   J
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

     A    B    C    D    E    F    G    H    I    J
0  220  235    0   15   15  195   45   95  105  180
1  115   30  120  120   60    5  190  195  115  230
2  120   85  185  125   65   40   45  100   80   25
3   75  235    0   90  175  120  245  145   95   95
4   70  195  160    5   45  160  155   50  115  175

     A    B    C    D    E    F   G    H    I    J
0   55  140  170    0    0  180  25  190  200   85
1   75   20  205  210  155    5   5  195  205  175
2  190   55  230   90  135    0  70  175   60  210
3  100   55   20   30   20  235  15   60  180  200
4   70   75  100  175  115   75  65  105  240  245

In [101]:
# 고객 구매데이터 생성(id, 성별, 연령, 지역, 상품, 가격, 구매시간)

import numpy as np
import pandas as pd

a = np.arange(10)+1
sr_a = pd.Series(a, name = "id")
b = np.random.choice(["남", "여"], size = 10)
sr_b = pd.Series(b, name = "성별")
c = np.random.randint(20, 60, size = 10)
sr_c = pd.Series(c, name = "연령")
d = np.random.choice(["서울", "경기", "전북", "전남", "제주", "경북", "경남", "충북", "충남", "강원"], size = 10)
sr_d = pd.Series(d, name = "지역")
e = np.random.choice(["가전", "가구", "주방", "식품", "의류"], size = 10)
sr_e = pd.Series(e, name = "상품")
f = np.random.randint(1, 100, size = 10)*1000
sr_f = pd.Series(f, name = "가격")

df = pd.concat([sr_a, sr_b, sr_c, sr_d, sr_e, sr_f], axis = 1)

display(df)

   id 성별  연령  지역  상품     가격
0   1  남  24  경기  가구  66000
1   2  여  56  전남  가전  21000
2   3  남  43  경북  식품  37000
3   4  남  50  충북  가전  69000
4   5  남  45  전남  의류  81000
5   6  남  40  경남  가구  48000
6   7  남  53  경남  의류  11000
7   8  여  57  충북  가전  95000
8   9  여  43  강원  식품  92000
9  10  남  47  경기  주방  44000

In [90]:
import pandas as pd
import numpy as np

a = np.arange(10)+1
sr_a = pd.Series(a, name = "ID")
b = np.random.randint(1,9,size=10)
sr_b = pd.Series(b, name = "Prod")
c = np.random.rand(10)*1000
sr_c = pd.Series(c, name = "Price")

df = pd.concat([sr_a, sr_b, sr_c], axis=1)
display(df)

   ID  Prod       Price
0   1     7  369.808093
1   2     1  146.441763
2   3     7  569.618406
3   4     4  703.737279
4   5     7  288.476437
5   6     3  433.288062
6   7     4  756.106694
7   8     1  396.098275
8   9     5  896.038388
9  10     1  638.921076